Белгипрозем_2017/src/InformationRegisters/ПереносыСроковВыполненияПроцессовИЗадач/ПереносыСроковВыполненияПроцессовИЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПереносыСроковВыполненияПроцессовИЗадач</name>
  <resources>
    <name>БизнесПроцессПереноса</name>
    <comment>Заявка, в рамках которой произведен перенос срока</comment>
    <type>
      <types>BusinessProcessRef.РешениеВопросовВыполненияЗадач</types>
    </type>
  </resources>
  <resources>
    <name>Итерация</name>
    <comment>Номер итерации согласования заявки на перенос срока, в рамках которой произведен перенос</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КомментарийАвтора</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НовыйСрок</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>СтарыйСрок</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаПереносаСрока</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/ПереносыСроковВыполненияПроцессовИЗадач/Forms/ФормаСпискаПоПроцессу/Module.bsl
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.БизнесПроцесс) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	БизнесПроцесс = Параметры.БизнесПроцесс;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач") Тогда
		Элементы.СтарыйСрок.Формат = "ДФ='dd.MM.yyyy'";
		Элементы.НовыйСрок.Формат = "ДФ='dd.MM.yyyy'";
		Элементы.СтарыйСрок.Ширина = 5;
		Элементы.НовыйСрок.Ширина = 5;
	КонецЕсли;
	
	Если Параметры.Свойство("СкрытьКоманднуюПанель") Тогда
		Элементы.ГруппаКоманднаяПанельФормы.Видимость = Ложь;
		Элементы.БизнесПроцесс.Видимость = Ложь;
	КонецЕсли;
	
	Предметы = Новый Массив();
	Предметы.Добавить(БизнесПроцесс);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &БизнесПроцесс";
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Предметы.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Предметы", Предметы);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ПереносыСроковВыполненияПроцессовИЗадач.Предмет) КАК Колво
		|ИЗ
		|	РегистрСведений.ПереносыСроковВыполненияПроцессовИЗадач КАК ПереносыСроковВыполненияПроцессовИЗадач
		|ГДЕ
		|	ПереносыСроковВыполненияПроцессовИЗадач.Предмет В (&Предметы)";
	
	Запрос.УстановитьПараметр("Предметы", Предметы);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоличествоПереносовСроков = Выборка.Колво;
		Заголовок = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'История переносов сроков процесса (%1)'"),
				Строка(КоличествоПереносовСроков));
	КонецЕсли;
	
КонецПроцедуры
